/*
Для корректной работы расчета фундамента целесообразно будет генерировать отдельно схему для фундамента с указанием нагрузок, как равномерных, так и точечных.
Схема фундамента генерируется после ввода всего проекта: стен, перекрытий, кровли, проемов
При этом определить и записать в каждую линию фундамента:

1) есть ли у этой линии симметричная сторона для приложения нагрузки, то есть сторона, параллельная ей и опирающаяся на существкющую несущую стену. 
Например, a и b. Это только для прямоугольных перекрытий.
2) для каждой линии посчитать кол-во квадратных метров перекрытия, приходящихся на 1 метр данной линии для двух случаев:
- при равноопорном опирании - только на те стороны, которые опираются на 
Для всего перекрытия в целом: является ли оно прямоугольным. 

Короче, чето слишком сложно для первой версии. Возьмем посчитаем общую массу дома и разделим на общий метраж несущих стен, получим нагрузку, исходя из которой все и посчитаем.
Однако, даже для этого следует для каждого перекрытия сохранить не только его этаж, но и является ли оно прямоугольным,
так как при выборе типа перекрытий "поиты ПК" не прямоугольные участки считаются как монолитные.

*/
// Посчитаем массу перекрытий
function calcPlateWeight(plate_element, specificWeight) {

}

// Посчитаем нагрузку на линию
function linePayload(line, wallSquare, specificWeight) {

}

// Посчитаем массу дома
// Чтобы быстро считать массу (а также цену!) дома, целесообразно хранить в схеме проекта что то типа "материального" образа дома, который представляет собой раскладку по кол-ву материалов дома
// создадим такой тестовый массивчик, который в идеале получать от Евгения
var planVolumes = []; // в принципе, эту же модель можно использовать и для кастома, дополняя ее данными

planVolumes = { // площади стен и другие строительные объемы для быстрого расчета стоимости
    walls: { // площади
        outdoor_living: 300,
        outdoor_uninhabited: 100,
        partition_living: 400, // подрузамевается, что все что не перегородки - несущие стены
        partition_uninhabited: 50,
        indoor_living: 50,
        indoor_uninhabited: 30
    },
    fasade: [203.4], // площадь фасада. Пока единая, в кастоме возможны варианты, описание которых наверное стоит хранить отдельно, а здесь только связь по id
    roof: 100, // площадь
    lintels: [ // lintel - перемычка в строительном контексте
        [1000, "outdoor_living"], // длина пролета 
        [1200, "outdoor_living"],
        [800, "outdoor_uninhabited"],
        [1800, "indoor_living"],
        [2800, "indoor_uninhabited"]
    ],
    plates: [ // расписать и сохранить здесь конкретные плиты не получится, поскольку мы пока не знаем материал стен, а от этого зависит ширина пролета
        [1, 3000, 4000, true, true, 12], // этаж, размер 1 (для прямоугольных), размер 2 (аналогично), возможность опирания на эту стороны только с двух сторон, аналогично, площадь. Если размеров нет, значит непрямоугольная форма
        [1, , , , , 2.4], // это как бы эркер
        [2, 2000, 4000, false, true, 8] // перекрытие опирается с трех сторон, то есть с одной стороны не имеет опоры - например, где лестница
    ] // теоретически, примерную стоимость с плитами можно было бы вычислит просто по средним ценами

};

// теперь пользовательские настройки материалов


function houseWeight(scheme,) {

}